Revit 2027 API
ParameterTypeId.ConnectorDiameter Property
 "Diameter"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ConnectorDiameter { get; }
Public Shared ReadOnly Property ConnectorDiameter As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ConnectorDiameter {
	ForgeTypeId^ get ();
}
static member ConnectorDiameter : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace